# Готово

from .defs import *

theme = "Геометриялык маселелер 5-класс"


def ques_001():
    d = generate(1, 89)
    t = """Эгерде тик бурчтуу үч бурчтукта бир бурч \\( {}^\\circ \\) га барабар болсо, экинчи
     бурч канча градуска барабар?""".format(d)
    z = {}
    z["vop"] = t
    z["otv"] = "$${}^\\circ $$".format(90 - d)
    z["ball"] = 1
    return z


def ques_002():
    a, b, c = generate3(5, 20)
    t = """Ормондо жагынын узундуктары {}м, {}м, {}м болгон тик бурчтуу жыгач параллелепипед бар.
     Ормон ал фигураны узундугу 1м болгон кубдарга кескилеп салса, канча кубик пайда болот?""".format(a, b, c)
    o = a * b * c
    z = {}
    z["vop"] = t
    z["otv"] = o
    z["ball"] = 1
    return z


def ques_003():
    s = generate(10, 100)
    h = generate(3, 20)
    t = """Бассейнге \\({}м^3\\) суу батат. Бассейндин бийиктиги {}мге барабар болсо,
    негизинин аянтын тапкыла""".format(s * h, h)
    z = {}
    z["vop"] = t
    z["otv"] = "$${}м^2$$".format(s)
    z["ball"] = 1
    return z


def ques_004():
    a, b = generate2(4, 10)
    t = """Барактын бир бетинин аянты - \\({}м^2\\). Эгерде ал баракты жарымынан бүктөсө,
     аянты канча болуп калат?""".format(a * b * 2)
    o = "{}\\(м^2\\)".format(a * b)
    z = {}
    z["vop"] = t
    z["otv"] = o
    z["ball"] = 1
    return z


def ques_005():
    a = generate(1, 20)
    b = generate(1, 20)

    t = """Тик бурчтуктун туурасы - {}см, ал эми узундугу - {}см. Бул тик бурчтуктун
     аянты менен периметринин суммасын тапкыла""".format(min(a, b), max(a, b))
    z = {}
    z["vop"] = t
    z["otv"] = a * b + 2 * (a + b)
    z["ball"] = 1
    return z


za = [ques_001, ques_002, ques_003, ques_004, ques_005]
